{
  "meta": {
    "title": "شکیل حیدر کا تجربہ",
    "description": "شکیل حیدر کا تجربہ ریزیومے",
    "keywords": "تجربہ، شکیل حیدر، ویب ڈویلپمنٹ، سافٹ ویئر ڈویلپمنٹ، UI/UX ڈیزائن، DevOps، ڈویلپمنٹ، آپریشن فرنٹ اینڈ لیڈ ڈویلپر، RunOfShowApp، فل اسٹیک ڈویلپر، فری لانسر، Sky Electric Pvt. Ltd، Concept Recall Pvt. Ltd، Retrocube Pvt. Ltd",
    "author": "شکیل حیدر"
  },
  "data": {
    "title": "ریزیومے",
    "description": "سافٹ ویئر ڈویلپمنٹ میں 5 سال سے زیادہ کے تجربے کے ساتھ، میں نے فرنٹ اینڈ، موبائل، اور فل اسٹیک ڈومینز میں کام کیا ہے، Sky Electric Pvt. Ltd میں ایک انٹرن کے طور پر شروع کیا اور Concept Recall Pvt. Ltd اور Retrocube Pvt. Ltd میں کرداروں تک ترقی کی۔ فی الحال، میں RunOfShowApp میں فرنٹ اینڈ لیڈ ڈویلپر ہوں، ایک ٹیم کی قیادت کر رہا ہوں تاکہ صارف دوست انٹرفیسز بنائے جا سکیں جبکہ 2020 سے فل اسٹیک ڈویلپر کے طور پر فری لانسنگ بھی کر رہا ہوں۔ میرا کیریئر موافقت، ٹیم ورک، اور اعلیٰ معیار کے حل کے عزم کو ظاہر کرتا ہے۔ کوڈنگ اور مسئلہ حل کرنے کے لیے پرجوش، میں ایک ورسٹائل ڈویلپر کے طور پر مسلسل سیکھتا اور ترقی کرتا ہوں۔",
    "items": [
      {
        "title": "ٹیم لیڈ",
        "companyName": "BCDApps",
        "date": "2022 - موجودہ",
        "description": "فرنٹ اینڈ ڈویلپمنٹ کی قیادت کرنا، صارف دوست انٹرفیس بنانے اور اعلیٰ معیار کے کوڈ کے معیار کو یقینی بنانے کے لیے ایک ٹیم کی نگرانی کرنا۔"
      },
      {
        "title": "فل اسٹیک ڈویلپر (فری لانسر)",
        "companyName": "Upwork",
        "date": "2024 - موجودہ",
        "description": "مختلف کلائنٹس کے لیے اینڈ ٹو اینڈ ویب حل فراہم کرنا، متنوع منصوبے کی ضروریات کو پورا کرنے کے لیے فرنٹ اینڈ اور بیک اینڈ ڈویلپمنٹ دونوں پر توجہ مرکوز کرنا۔"
      },
      {
        "title": "سافٹ ویئر ڈویلپر",
        "companyName": "Retrocube Pvt. Ltd.",
        "date": "2021 - 2022",
        "description": "اسکیل ایبل ویب ایپلی کیشنز بنانے کے لیے کراس فنکشنل ٹیموں کے ساتھ تعاون کرتے ہوئے فل اسٹیک ڈویلپمنٹ پروجیکٹس میں حصہ لیا۔"
      },
      {
        "title": "جونیئر سافٹ ویئر ڈویلپر",
        "companyName": "Concept Recall Pvt. Ltd.",
        "date": "2020 - 2021",
        "description": "ویب ایپلی کیشنز کی ترقی اور دیکھ بھال میں معاونت کی، مختلف ٹیکنالوجیز اور فریم ورکس میں تجربہ حاصل کیا۔"
      },
      {
        "title": "سافٹ ویئر ڈویلپمنٹ انٹرن",
        "companyName": "Sky Electric Pvt. Ltd.",
        "date": "2019 - 2020",
        "description": "سافٹ ویئر ڈویلپمنٹ میں عملی تجربہ حاصل کیا، حقیقی دنیا کے منصوبوں پر کام کیا اور صنعت کے بہترین طریقوں کو سیکھا۔"
      }
    ]
  }
}
