{
  "meta": {
    "title": "شکیل حیدر کی تعلیم",
    "description": "شکیل حیدر کی تعلیم",
    "keywords": "ریزیومے، شکیل حیدر، تجربہ، تعلیم، مہارتیں، میرے بارے میں، ویب ڈویلپمنٹ، سافٹ ویئر ڈویلپمنٹ، UI/UX ڈیزائن، DevOps، ڈویلپمنٹ، آپریشن، یوزر انٹرفیس ڈیزائن، یوزر ایکسپیرینس ڈیزائن، ویب ایپس، موبائل ایپس، BS سافٹ ویئر انجینئرنگ، انڈس یونیورسٹی، FSc پری انجینئرنگ، پاکستان شپ اونرز کالج، SSC، النصر اسکول",
    "author": "شکیل حیدر"
  },
  "data": {
    "title": "ریزیومے",
    "description": "میرا تعلیمی سفر النصر اسکول پرائیویٹ سے SSC کے ساتھ شروع ہوا، جس نے مسئلہ حل کرنے میں میری دلچسپی کو بڑھایا۔ میں نے پاکستان شپ اونرز کالج میں FSc پری انجینئرنگ کی تعلیم حاصل کی، جس سے میری تجزیاتی مہارتیں مضبوط ہوئیں۔ بعد میں، میں نے انڈس یونیورسٹی پرائیویٹ لمیٹڈ سے سافٹ ویئر انجینئرنگ میں BS کی ڈگری حاصل کی، جس سے پروگرامنگ اور سافٹ ویئر ڈیزائن میں مہارت حاصل ہوئی۔ اس تعلیمی بنیاد نے میری تکنیکی مہارتوں اور ترقی کے ذہن کو تشکیل دیا ہے، جو مجھے سافٹ ویئر ڈویلپمنٹ میں ایک کامیاب کیریئر کے لیے تیار کرتا ہے۔",
    "items": [
      {
        "title": "ایم ایس آرٹیفیشل انٹیلی جنس",
        "companyName": "اقرا یونیورسٹی پرائیویٹ لمیٹڈ۔",
        "date": "2026 - جاری",
        "description": "سافٹ ویئر ڈویلپمنٹ، الگورتھم، اور سسٹم ڈیزائن پر توجہ مرکوز کی، منصوبوں اور انٹرن شپ کے ذریعے عملی تجربہ حاصل کیا۔"
      },
      {
        "title": "بی ایس سافٹ ویئر انجینئرنگ",
        "companyName": "انڈس یونیورسٹی پرائیویٹ لمیٹڈ۔",
        "date": "2016 - 2020",
        "description": "سافٹ ویئر ڈویلپمنٹ، الگورتھم، اور سسٹم ڈیزائن پر توجہ مرکوز کی، منصوبوں اور انٹرن شپ کے ذریعے عملی تجربہ حاصل کیا۔"
      },
      {
        "title": "ایف ایس سی پری انجینئرنگ",
        "companyName": "پاکستان شپ اونرز کالج",
        "date": "2014 - 2016",
        "description": "اعلیٰ ریاضی، فزکس، اور کیمسٹری کا مطالعہ کیا، مضبوط تجزیاتی اور مسئلہ حل کرنے کی مہارتیں تیار کیں۔"
      },
      {
        "title": "ایس ایس سی",
        "companyName": "النصر اسکول پرائیویٹ لمیٹڈ۔",
        "date": "2012 - 2014",
        "description": "سائنس مضامین پر توجہ مرکوز کرتے ہوئے ثانوی تعلیم مکمل کی، جس سے انجینئرنگ میں مستقبل کی تعلیم کے لیے بنیاد رکھی گئی۔"
      }
    ]
  }
}
