{
    "meta": {
        "title": "شکیل حیدر کے کام",
        "description": "شکیل حیدر کے کام",
        "keywords": "کام، شکیل حیدر، منصوبے، پورٹ فولیو، ویب ڈویلپمنٹ، سافٹ ویئر ڈویلپمنٹ، UI/UX ڈیزائن، DevOps، ڈویلپمنٹ، آپریشن، یوزر انٹرفیس ڈیزائن، یوزر ایکسپیرینس ڈیزائن، ویب ایپس، موبائل ایپس",
        "author": "شکیل حیدر"
    },
    "data": {
        "title": "کام",
        "items": [
            {
                "count": "01",
                "role": "فرنٹ اینڈ لیڈ",
                "desc": "RunOfShow ایک ویب ایپلیکیشن ہے جو ایونٹ کے منتظمین کو اپنے ایونٹس کو مؤثر طریقے سے منظم کرنے میں مدد کرتی ہے۔ یہ ایونٹ کے شیڈولز بنانے، منظم کرنے اور شیئر کرنے کا ایک پلیٹ فارم فراہم کرتی ہے، جو صارفین کو ایونٹس کو بغیر کسی رکاوٹ کے منظم اور انجام دینے کے قابل بناتی ہے۔ فرنٹ اینڈ لیڈ ڈویلپر کے طور پر، میں نے ایپلیکیشن کی ترقی کی قیادت کی، صارف دوست انٹرفیس بنائے اور ہموار صارف تجربہ کو یقینی بنایا۔"
            },
            {
                "count": "02",
                "role": "فل اسٹیک ڈویلپر",
                "desc": "Hello Aya ایک ویب ایپلیکیشن ہے جو صارفین کو اپنے قیام کے لیے کمرہ یا اپارٹمنٹ ریزرو اور بک کرنے کی سہولت فراہم کرتی ہے۔ یہ صارفین کو دستیاب کمروں کو تلاش کرنے، تفصیلات دیکھنے اور بکنگ کرنے کی اجازت دیتی ہے۔ ایک فل اسٹیک ڈویلپر کے طور پر، میں نے ایپلیکیشن کی ترقی میں حصہ لیا، جس میں جواب دہ اور بدیہی صارف انٹرفیس اور مضبوط بیک اینڈ فعالیت بنانے پر توجہ مرکوز کی۔"
            },
            {
                "count": "03",
                "role": "فل اسٹیک ڈویلپر",
                "desc": "Hey Planner ایک ویب ایپلیکیشن ہے جو صارفین کو ایونٹس کی منصوبہ بندی اور تنظیم میں مدد کرتی ہے۔ یہ ایونٹ کی تفصیلات بنانے، منظم کرنے اور شیئر کرنے کا ایک پلیٹ فارم فراہم کرتی ہے، جو صارفین کو ایونٹس کو بغیر کسی رکاوٹ کے ہم آہنگ اور انجام دینے کے قابل بناتی ہے۔ ایک فل اسٹیک ڈویلپر کے طور پر، میں نے ایپلیکیشن کی ترقی میں حصہ لیا، جس میں جواب دہ اور بدیہی صارف انٹرفیس اور مضبوط بیک اینڈ فعالیت بنانے پر توجہ مرکوز کی۔"
            },
            {
                "count": "04",
                "role": "فرنٹ اینڈ ڈویلپر",
                "desc": "Stunt Listing ایک ویب ایپلیکیشن ہے جو اسٹنٹ پرفارمرز کو ایونٹ کے منتظمین سے جوڑتی ہے۔ یہ پرفارمرز کو پروفائل بنانے، اپنی مہارتوں کو دکھانے اور ملازمتوں کے لیے درخواست دینے کی اجازت دیتی ہے، جبکہ منتظمین ایونٹس پوسٹ کر سکتے ہیں، پرفارمر پروفائلز دیکھ سکتے ہیں اور ٹیلنٹ کی خدمات حاصل کر سکتے ہیں۔ ایک فرنٹ اینڈ ڈویلپر کے طور پر، میں نے ایپلیکیشن کی ترقی میں حصہ لیا، جس میں جواب دہ اور بدیہی صارف انٹرفیس بنانے پر توجہ مرکوز کی۔"
            },
            {
                "count": "05",
                "role": "فل اسٹیک ڈویلپر",
                "desc": "Minglee ایک سوشل نیٹ ورکنگ ایپلیکیشن ہے جو مشترکہ دلچسپیوں کی بنیاد پر صارفین کو جوڑتی ہے۔ یہ صارفین کو پروفائل بنانے، دوسروں کے ساتھ جڑنے اور مواد شیئر کرنے کی اجازت دیتی ہے، جو ہم خیال افراد کی کمیونٹی کو فروغ دیتی ہے۔ ایک فل اسٹیک ڈویلپر کے طور پر، میں نے ایپلیکیشن کی ترقی میں حصہ لیا، جس میں ایک ہموار صارف تجربہ اور مضبوط بیک اینڈ آرکیٹیکچر بنانے پر توجہ مرکوز کی۔"
            },
            {
                "count": "06",
                "role": "موبائل ڈویلپر",
                "desc": "RunOfShowApp ایک موبائل ایپلیکیشن ہے جو ایونٹ کے منتظمین کو اپنے ایونٹس کو مؤثر طریقے سے منظم کرنے میں مدد کرتی ہے۔ یہ ایونٹ کے شیڈولز بنانے، منظم کرنے اور شیئر کرنے کا ایک پلیٹ فارم فراہم کرتی ہے، جو صارفین کو ایونٹس کو بغیر کسی رکاوٹ کے منظم اور انجام دینے کے قابل بناتی ہے۔ ایک موبائل ڈویلپر کے طور پر، میں نے ایپلیکیشن کی ترقی میں حصہ لیا، جس میں ایک ہموار صارف تجربہ اور بدیہی انٹرفیس بنانے پر توجہ مرکوز کی۔"
            },
            {
                "count": "07",
                "role": "موبائل ڈویلپر",
                "desc": "SkyElectric ایک موبائل ایپلیکیشن ہے جو صارفین کو اپنے شمسی توانائی کے نظام کو مانیٹر اور کنٹرول کرنے کی اجازت دیتی ہے۔ یہ توانائی کی پیداوار، کھپت اور بچت پر حقیقی وقت کا ڈیٹا فراہم کرتی ہے، جو صارفین کو اپنی توانائی کے استعمال کو بہتر بنانے کے قابل بناتی ہے۔ ایک موبائل ڈویلپر کے طور پر، میں نے ایپلیکیشن کی ترقی میں حصہ لیا، جس میں ایک صارف دوست انٹرفیس اور ہموار صارف تجربہ بنانے پر توجہ مرکوز کی۔"
            }
        ]
    }
}