{
    "meta": {
        "title": "Shakeel Haider의 작품",
        "description": "Shakeel Haider의 작품",
        "keywords": "작품, shakeel haider, 프로젝트, 포트폴리오, 웹 개발, 소프트웨어 개발, UI/UX 디자인, DevOps, 개발, 운영, 사용자 인터페이스 디자인, 사용자 경험 디자인, 웹 앱, 모바일 앱",
        "author": "Shakeel Haider"
    },
    "data": {
        "title": "작품",
        "items": [
            {
                "count": "01",
                "role": "프런트엔드 리드",
                "desc": "RunOfShow는 이벤트 주최자가 이벤트를 효율적으로 관리할 수 있도록 돕는 웹 애플리케이션입니다. 이벤트 일정을 생성, 관리 및 공유할 수 있는 플랫폼을 제공하여 사용자가 이벤트를 원활하게 구성하고 실행할 수 있도록 합니다. 프런트엔드 리드 개발자로서 저는 애플리케이션 개발을 이끌고 사용자 친화적인 인터페이스를 만들고 원활한 사용자 경험을 보장했습니다."
            },
            {
                "count": "02",
                "role": "풀스택 개발자",
                "desc": "Hello Aya는 사용자가 숙박을 위해 방이나 아파트를 예약할 수 있도록 하는 웹 애플리케이션입니다. 사용자는 사용 가능한 방을 검색하고 세부 정보를 보고 예약할 수 있습니다. 풀스택 개발자로서 저는 응답성 및 직관적인 사용자 인터페이스와 강력한 백엔드 기능 개발에 중점을 두고 애플리케이션 개발에 기여했습니다."
            },
            {
                "count": "03",
                "role": "풀스택 개발자",
                "desc": "Hey Planner는 사용자가 이벤트를 계획하고 구성할 수 있도록 돕는 웹 애플리케이션입니다. 이벤트 세부 정보를 생성, 관리 및 공유할 수 있는 플랫폼을 제공하여 사용자가 이벤트를 원활하게 조정하고 실행할 수 있도록 합니다. 풀스택 개발자로서 저는 응답성 및 직관적인 사용자 인터페이스와 강력한 백엔드 기능 개발에 중점을 두고 애플리케이션 개발에 기여했습니다."
            },
            {
                "count": "04",
                "role": "프런트엔드 개발자",
                "desc": "Stunt Listing은 스턴트 연기자와 이벤트 주최자를 연결하는 웹 애플리케이션입니다. 연기자는 프로필을 만들고 기술을 선보이며 공연에 지원할 수 있으며, 주최자는 이벤트를 게시하고 연기자 프로필을 보고 인재를 고용할 수 있습니다. 프런트엔드 개발자로서 저는 응답성 및 직관적인 사용자 인터페이스 개발에 중점을 두고 애플리케이션 개발에 기여했습니다."
            },
            {
                "count": "05",
                "role": "풀스택 개발자",
                "desc": "Minglee는 공통 관심사를 기반으로 사용자를 연결하는 소셜 네트워킹 애플리케이션입니다. 사용자는 프로필을 만들고 다른 사용자와 연결하고 콘텐츠를 공유하여 비슷한 생각을 가진 사람들의 커뮤니티를 조성할 수 있습니다. 풀스택 개발자로서 저는 원활한 사용자 경험과 강력한 백엔드 아키텍처를 만드는 데 중점을 두고 애플리케이션 개발에 기여했습니다."
            },
            {
                "count": "06",
                "role": "모바일 개발자",
                "desc": "RunOfShowApp은 이벤트 주최자가 이벤트를 효율적으로 관리할 수 있도록 돕는 모바일 애플리케이션입니다. 이벤트 일정을 생성, 관리 및 공유할 수 있는 플랫폼을 제공하여 사용자가 이벤트를 원활하게 구성하고 실행할 수 있도록 합니다. 모바일 개발자로서 저는 원활한 사용자 경험과 직관적인 인터페이스를 만드는 데 중점을 두고 애플리케이션 개발에 기여했습니다."
            },
            {
                "count": "07",
                "role": "모바일 개발자",
                "desc": "SkyElectric은 사용자가 태양 에너지 시스템을 모니터링하고 제어할 수 있도록 하는 모바일 애플리케이션입니다. 에너지 생산, 소비 및 절감에 대한 실시간 데이터를 제공하여 사용자가 에너지 사용량을 최적화할 수 있도록 합니다. 모바일 개발자로서 저는 사용자 친화적인 인터페이스와 원활한 사용자 경험을 만드는 데 중점을 두고 애플리케이션 개발에 기여했습니다."
            }
        ]
    }
}