{
  "meta": {
    "title": "Опыт Шакила Хайдера",
    "description": "Резюме опыта Шакила Хайдера",
    "keywords": "опыт, Шакил Хайдер, веб-разработка, разработка программного обеспечения, UI/UX-дизайн, DevOps, разработка, эксплуатация, ведущий разработчик frontend, RunOfShowApp, fullstack-разработчик, фрилансер, Sky Electric Pvt. Ltd, Concept Recall Pvt. Ltd, Retrocube Pvt. Ltd",
    "author": "Шакил Хайдер"
  },
  "data": {
    "title": "Резюме",
    "description": "Имея более 5 лет опыта в разработке программного обеспечения, я работал в области frontend, мобильной и full-stack разработки, начав в качестве стажера в Sky Electric Pvt. Ltd и продвинувшись до должностей в Concept Recall Pvt. Ltd и Retrocube Pvt. Ltd. В настоящее время я являюсь ведущим разработчиком frontend в RunOfShowApp, возглавляя команду по созданию удобных пользовательских интерфейсов, а также с 2020 года работаю фрилансером в качестве fullstack-разработчика. Моя карьера демонстрирует адаптивность, умение работать в команде и приверженность высококачественным решениям. Увлеченный кодированием и решением проблем, я постоянно учусь и расту как разносторонний разработчик.",
    "items": [
      {
        "title": "Руководитель группы",
        "companyName": "BCDApps",
        "date": "2022 - по настоящее время",
        "description": "Руководство разработкой frontend, надзор за командой по созданию удобных пользовательских интерфейсов и обеспечение высоких стандартов качества кода."
      },
      {
        "title": "Fullstack-разработчик (фрилансер)",
        "companyName": "Upwork",
        "date": "2024 - по настоящее время",
        "description": "Предоставление комплексных веб-решений для различных клиентов с упором на разработку как frontend, так и backend для удовлетворения разнообразных требований проекта."
      },
      {
        "title": "Разработчик программного обеспечения",
        "companyName": "Retrocube Pvt. Ltd.",
        "date": "2021 - 2022",
        "description": "Участвовал в проектах по full-stack разработке, сотрудничая с межфункциональными командами для создания масштабируемых веб-приложений."
      },
      {
        "title": "Младший разработчик программного обеспечения",
        "companyName": "Concept Recall Pvt. Ltd.",
        "date": "2020 - 2021",
        "description": "Помогал в разработке и поддержке веб-приложений, приобретая опыт в различных технологиях и фреймворках."
      },
      {
        "title": "Стажер-разработчик программного обеспечения",
        "companyName": "Sky Electric Pvt. Ltd.",
        "date": "2019 - 2020",
        "description": "Получил практический опыт в разработке программного обеспечения, работая над реальными проектами и изучая лучшие отраслевые практики."
      }
    ]
  }
}