{
  "meta": {
    "title": "О Шакиле Хайдере",
    "description": "О Шакиле Хайдере",
    "keywords": "резюме, шакил хайдер, опыт, образование, навыки, обо мне, веб-разработка, разработка программного обеспечения, UI/UX дизайн, DevOps, Разработка, эксплуатация, дизайн пользовательского интерфейса, дизайн пользовательского опыта, веб-приложения, мобильные приложения",
    "author": "Шакил Хайдер"
  },
  "data": {
    "title": "Резюме",
    "description": "Я увлеченный и преданный своему делу разработчик программного обеспечения с более чем 5-летним опытом в разработке фронтенда, бэкенда и баз данных. Мой путь в индустрии технологий был обусловлен глубоким любопытством к решению проблем и стремлением к предоставлению высококачественных, масштабируемых решений. Я процветаю в динамичных средах, где могу использовать свой технический опыт для создания инновационных приложений, которые оказывают реальное влияние.",
    "items": [
        {
            "title": "💼 Опыт",
            "description": "Моя карьера началась со стажировки в Sky Electric Pvt. Ltd, где я получил базовые знания в разработке программного обеспечения и отточил свои навыки решения проблем. Оттуда я перешел на должности в Concept Recall Pvt. Ltd в качестве младшего веб-разработчика, где я работал над созданием и поддержкой веб-приложений, а затем в Retrocube Pvt. Ltd в качестве младшего мобильного разработчика, где я внес свой вклад в разработку мобильных приложений. В настоящее время я работаю ведущим фронтенд-разработчиком в RunOfShowApp, возглавляя команду по разработке и внедрению удобных пользовательских интерфейсов, обеспечивая при этом бесшовный пользовательский опыт.<br /><br /> В дополнение к моей основной работе, я фрилансер Fullstack Developer с 2020 года, выполняя разнообразные проекты, которые позволили мне отточить свои навыки как во фронтенд, так и в бэкенд-разработке. Моя способность адаптироваться к новым технологиям, эффективно сотрудничать с кросс-функциональными командами и предоставлять надежные решения является краеугольным камнем моего профессионального роста.<br /><br /> Я увлечен кодированием, решением проблем и постоянным обучением, что подпитывает мое стремление оставаться в курсе последних тенденций и технологий в отрасли. Будь то создание масштабируемых бэкенд-систем, разработка интуитивно понятных пользовательских интерфейсов или оптимизация производительности баз данных, я привержен достижению совершенства в каждом проекте, который я предпринимаю."
        },
        {
            "title": "🎓 Образование",
            "description": "Мой образовательный путь начался с SSC в школе Al Nasir Pvt., что вызвало мой интерес к решению проблем. Я изучал FSc Pre-Engineering в Пакистанском колледже судовладельцев, укрепляя свои аналитические навыки. Позже я получил степень бакалавра программной инженерии в Indus University Pvt. Ltd., получив опыт в программировании и разработке программного обеспечения. Этот академический фундамент сформировал мои технические навыки и мышление роста, подготовив меня к успешной карьере в разработке программного обеспечения."
        },
        {
            "title": "🛠️ Навыки",
            "description": "Я специализируюсь на разработке фронтенда, бэкенда и баз данных, обладая опытом в создании удобных пользовательских интерфейсов, масштабируемых серверных приложений и эффективных систем управления базами данных. Мои навыки охватывают создание бесшовного пользовательского опыта, надежных API и оптимизированных решений для хранения данных, обеспечивая сквозную разработку высокопроизводительных и надежных программных приложений."
        }
    ]
  }
}
