{
    "meta": {
        "title": "Работы Шакила Хайдера",
        "description": "Работы Шакила Хайдера",
        "keywords": "работы, шакил хайдер, проекты, портфолио, веб-разработка, разработка программного обеспечения, UI/UX дизайн, DevOps, Разработка, эксплуатация, дизайн пользовательского интерфейса, дизайн пользовательского опыта, веб-приложения, мобильные приложения",
        "author": "Шакил Хайдер"
    },
    "data": {
        "title": "Работы",
        "items": [
            {
                "count": "01",
                "role": "Руководитель Frontend",
                "desc": "RunOfShow - это веб-приложение, которое помогает организаторам мероприятий эффективно управлять своими мероприятиями. Оно предоставляет платформу для создания, управления и обмена расписаниями мероприятий, позволяя пользователям беспрепятственно организовывать и проводить мероприятия. В качестве ведущего разработчика Frontend я руководил разработкой приложения, создавая удобные пользовательские интерфейсы и обеспечивая плавный пользовательский опыт."
            },
            {
                "count": "02",
                "role": "Full Stack Разработчик",
                "desc": "Hello Aya - это веб-приложение, которое позволяет пользователям бронировать номера или апартаменты для проживания. Оно позволяет пользователям искать доступные номера, просматривать детали и делать бронирования. В качестве Full Stack разработчика я внес свой вклад в разработку приложения, сосредоточившись на создании адаптивных и интуитивно понятных пользовательских интерфейсов и надежной функциональности бэкенда."
            },
            {
                "count": "03",
                "role": "Full Stack Разработчик",
                "desc": "Hey Planner - это веб-приложение, которое помогает пользователям планировать и организовывать мероприятия. Оно предоставляет платформу для создания, управления и обмена деталями мероприятий, позволяя пользователям беспрепятственно координировать и проводить мероприятия. В качестве Full Stack разработчика я внес свой вклад в разработку приложения, сосредоточившись на создании адаптивных и интуитивно понятных пользовательских интерфейсов и надежной функциональности бэкенда."
            },
            {
                "count": "04",
                "role": "Frontend Разработчик",
                "desc": "Stunt Listing - это веб-приложение, которое связывает каскадеров с организаторами мероприятий. Оно позволяет исполнителям создавать профили, демонстрировать свои навыки и подавать заявки на выступления, в то время как организаторы могут публиковать мероприятия, просматривать профили исполнителей и нанимать таланты. В качестве Frontend разработчика я внес свой вклад в разработку приложения, сосредоточившись на создании адаптивных и интуитивно понятных пользовательских интерфейсов."
            },
            {
                "count": "05",
                "role": "Full Stack Разработчик",
                "desc": "Minglee - это приложение для социальных сетей, которое связывает пользователей на основе общих интересов. Оно позволяет пользователям создавать профили, общаться с другими и делиться контентом, способствуя формированию сообщества единомышленников. В качестве Full Stack разработчика я внес свой вклад в разработку приложения, сосредоточившись на создании бесшовного пользовательского опыта и надежной архитектуры бэкенда."
            },
            {
                "count": "06",
                "role": "Мобильный Разработчик",
                "desc": "RunOfShowApp - это мобильное приложение, которое помогает организаторам мероприятий эффективно управлять своими мероприятиями. Оно предоставляет платформу для создания, управления и обмена расписаниями мероприятий, позволяя пользователям беспрепятственно организовывать и проводить мероприятия. В качестве мобильного разработчика я внес свой вклад в разработку приложения, сосредоточившись на создании бесшовного пользовательского опыта и интуитивно понятного интерфейса."
            },
            {
                "count": "07",
                "role": "Мобильный Разработчик",
                "desc": "SkyElectric - это мобильное приложение, которое позволяет пользователям контролировать свои системы солнечной энергии. Оно предоставляет данные в реальном времени о производстве энергии, потреблении и экономии, позволяя пользователям оптимизировать свое энергопотребление. В качестве мобильного разработчика я внес свой вклад в разработку приложения, сосредоточившись на создании удобного пользовательского интерфейса и бесшовного пользовательского опыта."
            }
        ]
    }
}