{
  "meta": {
    "title": "خبرة شاكيل حيدر",
    "description": "سيرة ذاتية لخبرة شاكيل حيدر",
    "keywords": "خبرة, شاكيل حيدر, تطوير الويب, تطوير البرمجيات, تصميم UI/UX, DevOps, تطوير, تشغيل, مطور واجهة أمامية رئيسي, RunOfShowApp, مطور متكامل, مستقل, Sky Electric Pvt. Ltd, Concept Recall Pvt. Ltd, Retrocube Pvt. Ltd",
    "author": "شاكيل حيدر"
  },
  "data": {
    "title": "السيرة الذاتية",
    "description": "مع أكثر من 5 سنوات في تطوير البرمجيات، عملت عبر مجالات الواجهة الأمامية والجوال والتطوير المتكامل، بدءًا من متدرب في Sky Electric Pvt. Ltd وتقدمت إلى أدوار في Concept Recall Pvt. Ltd و Retrocube Pvt. Ltd. حاليًا، أنا مطور الواجهة الأمامية الرئيسي في RunOfShowApp، حيث أقود فريقًا لإنشاء واجهات سهلة الاستخدام بينما أعمل كمطور متكامل مستقل منذ عام 2020. تظهر مسيرتي المهنية القدرة على التكيف والعمل الجماعي والالتزام بتقديم حلول عالية الجودة. شغوف بالبرمجة وحل المشكلات، أتعلم وأنمو باستمرار كمطور متعدد الاستخدامات.",
    "items": [
      {
        "title": "قائد فريق",
        "companyName": "BCDApps",
        "date": "2022 - حتى الآن",
        "description": "قيادة تطوير الواجهة الأمامية، والإشراف على فريق لإنشاء واجهات سهلة الاستخدام، وضمان معايير جودة عالية للكود."
      },
      {
        "title": "مطور متكامل (مستقل)",
        "companyName": "Upwork",
        "date": "2024 - حتى الآن",
        "description": "تقديم حلول ويب متكاملة لمختلف العملاء، مع التركيز على تطوير الواجهة الأمامية والخلفية لتلبية متطلبات المشروع المتنوعة."
      },
      {
        "title": "مطور برمجيات",
        "companyName": "Retrocube Pvt. Ltd.",
        "date": "2021 - 2022",
        "description": "ساهمت في مشاريع تطوير متكاملة، بالتعاون مع فرق متعددة الوظائف لبناء تطبيقات ويب قابلة للتطوير."
      },
      {
        "title": "مطور برمجيات مبتدئ",
        "companyName": "Concept Recall Pvt. Ltd.",
        "date": "2020 - 2021",
        "description": "ساعدت في تطوير وصيانة تطبيقات الويب، واكتسبت خبرة في مختلف التقنيات والأطر."
      },
      {
        "title": "متدرب تطوير برمجيات",
        "companyName": "Sky Electric Pvt. Ltd.",
        "date": "2019 - 2020",
        "description": "اكتسبت خبرة عملية في تطوير البرمجيات، وعملت في مشاريع واقعية وتعلمت أفضل ممارسات الصناعة."
      }
    ]
  }
}
