{
    "meta": {
        "title": "أعمال شاكيل حيدر",
        "description": "أعمال شاكيل حيدر",
        "keywords": "أعمال, شاكيل حيدر, مشاريع, حافظة أعمال, تطوير الويب, تطوير البرمجيات, تصميم UI/UX, DevOps, تطوير, تشغيل, تصميم واجهة المستخدم, تصميم تجربة المستخدم, تطبيقات الويب, تطبيقات الجوال",
        "author": "شاكيل حيدر"
    },
    "data": {
        "title": "أعمال",
        "items": [
            {
                "count": "01",
                "role": "قائد الواجهة الأمامية",
                "desc": "RunOfShow هو تطبيق ويب يساعد منظمي الأحداث على إدارة فعالياتهم بكفاءة. يوفر منصة لإنشاء وإدارة ومشاركة جداول الأحداث، مما يتيح للمستخدمين تنظيم وتنفيذ الأحداث بسلاسة. بصفتي قائد مطوري الواجهة الأمامية، قمت بقيادة تطوير التطبيق، وإنشاء واجهات سهلة الاستخدام وضمان تجربة مستخدم سلسة."
            },
            {
                "count": "02",
                "role": "مطور متكامل",
                "desc": "Hello Aya هو تطبيق ويب يوفر للمستخدمين حجز وتأجير غرف أو شقق لإقامتهم. يسمح للمستخدمين بالبحث عن الغرف المتاحة، وعرض التفاصيل، وإجراء الحجوزات. بصفتي مطورًا متكاملًا، ساهمت في تطوير التطبيق، مع التركيز على إنشاء واجهات مستخدم سريعة الاستجابة وبديهية ووظائف خلفية قوية."
            },
            {
                "count": "03",
                "role": "مطور متكامل",
                "desc": "Hey Planner هو تطبيق ويب يساعد المستخدمين على تخطيط وتنظيم الأحداث. يوفر منصة لإنشاء وإدارة ومشاركة تفاصيل الأحداث، مما يتيح للمستخدمين تنسيق وتنفيذ الأحداث بسلاسة. بصفتي مطورًا متكاملًا، ساهمت في تطوير التطبيق، مع التركيز على إنشاء واجهات مستخدم سريعة الاستجابة وبديهية ووظائف خلفية قوية."
            },
            {
                "count": "04",
                "role": "مطور الواجهة الأمامية",
                "desc": "Stunt Listing هو تطبيق ويب يربط بين فناني الأداء ومنظمي الأحداث. يسمح للفنانين بإنشاء ملفات تعريف، وعرض مهاراتهم، والتقدم للوظائف، بينما يمكن للمنظمين نشر الأحداث، وعرض ملفات تعريف الفنانين، وتوظيف المواهب. بصفتي مطور الواجهة الأمامية، ساهمت في تطوير التطبيق، مع التركيز على إنشاء واجهات مستخدم سريعة الاستجابة وبديهية."
            },
            {
                "count": "05",
                "role": "مطور متكامل",
                "desc": "Minglee هو تطبيق شبكات اجتماعية يربط المستخدمين بناءً على اهتمامات مشتركة. يسمح للمستخدمين بإنشاء ملفات تعريف، والتواصل مع الآخرين، ومشاركة المحتوى، مما يعزز مجتمعًا من الأفراد ذوي التفكير المماثل. بصفتي مطورًا متكاملًا، ساهمت في تطوير التطبيق، مع التركيز على إنشاء تجربة مستخدم سلسة وبنية خلفية قوية."
            },
            {
                "count": "06",
                "role": "مطور جوال",
                "desc": "RunOfShowApp هو تطبيق جوال يساعد منظمي الأحداث على إدارة فعالياتهم بكفاءة. يوفر منصة لإنشاء وإدارة ومشاركة جداول الأحداث، مما يتيح للمستخدمين تنظيم وتنفيذ الأحداث بسلاسة. بصفتي مطور جوال، ساهمت في تطوير التطبيق، مع التركيز على إنشاء تجربة مستخدم سلسة وواجهة بديهية."
            },
            {
                "count": "07",
                "role": "مطور جوال",
                "desc": "SkyElectric هو تطبيق جوال يسمح للمستخدمين بمراقبة والتحكم في أنظمة الطاقة الشمسية الخاصة بهم. يوفر بيانات في الوقت الفعلي عن إنتاج الطاقة، والاستهلاك، والمدخرات، مما يتيح للمستخدمين تحسين استخدامهم للطاقة. بصفتي مطور جوال، ساهمت في تطوير التطبيق، مع التركيز على إنشاء واجهة سهلة الاستخدام وتجربة مستخدم سلسة."
            }
        ]
    }
}