{
  "meta": {
    "title": "Σχετικά με τον Shakeel Haider",
    "description": "Σχετικά με τον Shakeel Haider",
    "keywords": "βιογραφικό, shakeel haider, εμπειρία, εκπαίδευση, δεξιότητες, για μένα, ανάπτυξη ιστού, ανάπτυξη λογισμικού, σχεδιασμός UI/UX, DevOps, Ανάπτυξη, λειτουργία, σχεδιασμός διεπαφής χρήστη, σχεδιασμός εμπειρίας χρήστη, εφαρμογές ιστού, εφαρμογές κινητών",
    "author": "Shakeel Haider"
  },
  "data": {
    "title": "Βιογραφικό",
    "description": "Είμαι ένας παθιασμένος και αφοσιωμένος προγραμματιστής λογισμικού με πάνω από 5 χρόνια πρακτικής εμπειρίας στην ανάπτυξη frontend, backend και βάσεων δεδομένων. Το ταξίδι μου στον κλάδο της τεχνολογίας έχει οδηγηθεί από μια βαθιά περιέργεια για την επίλυση προβλημάτων και μια δέσμευση στην παροχή υψηλής ποιότητας, επεκτάσιμων λύσεων. Ευδοκιμώ σε δυναμικά περιβάλλοντα όπου μπορώ να αξιοποιήσω την τεχνική μου εμπειρία για να δημιουργήσω καινοτόμες εφαρμογές που έχουν πραγματικό αντίκτυπο.",
    "items": [
        {
            "title": "💼 Εμπειρία",
            "description": "Η καριέρα μου ξεκίνησε με πρακτική άσκηση στην Sky Electric Pvt. Ltd, όπου απέκτησα βασικές γνώσεις στην ανάπτυξη λογισμικού και βελτίωσα τις δεξιότητές μου στην επίλυση προβλημάτων. Από εκεί, προχώρησα σε ρόλους στην Concept Recall Pvt. Ltd ως Jr. Web Developer, όπου εργάστηκα στην κατασκευή και συντήρηση εφαρμογών ιστού, και αργότερα στην Retrocube Pvt. Ltd ως Jr. Mobile Developer, όπου συνέβαλα στην ανάπτυξη εφαρμογών κινητών. Επί του παρόντος, υπηρετώ ως Frontend Lead Developer στην RunOfShowApp, οδηγώντας μια ομάδα για τον σχεδιασμό και την υλοποίηση φιλικών προς τον χρήστη διεπαφών, ενώ διασφαλίζω απρόσκοπτες εμπειρίες χρήστη.<br /><br /> Εκτός από τους ρόλους πλήρους απασχόλησης, εργάζομαι ως ελεύθερος επαγγελματίας Fullstack Developer από το 2020, αναλαμβάνοντας διάφορα έργα που μου επέτρεψαν να βελτιώσω τις δεξιότητές μου τόσο στην ανάπτυξη frontend όσο και backend. Η ικανότητά μου να προσαρμόζομαι σε νέες τεχνολογίες, να συνεργάζομαι αποτελεσματικά με διαλειτουργικές ομάδες και να παρέχω ισχυρές λύσεις υπήρξε ακρογωνιαίος λίθος της επαγγελματικής μου ανάπτυξης.<br /><br /> Είμαι παθιασμένος με την κωδικοποίηση, την επίλυση προβλημάτων και τη συνεχή μάθηση, κάτι που τροφοδοτεί την επιθυμία μου να παραμένω ενημερωμένος με τις τελευταίες τάσεις και τεχνολογίες του κλάδου. Είτε πρόκειται για την κατασκευή επεκτάσιμων συστημάτων backend, τη δημιουργία διαισθητικών διεπαφών χρήστη ή τη βελτιστοποίηση της απόδοσης βάσεων δεδομένων, δεσμεύομαι να παρέχω αριστεία σε κάθε έργο που αναλαμβάνω."
        },
        {
            "title": "🎓 Εκπαίδευση",
            "description": "Το εκπαιδευτικό μου ταξίδι ξεκίνησε με το SSC από την Al Nasir School Pvt., προκαλώντας το ενδιαφέρον μου για την επίλυση προβλημάτων. Συνέχισα με FSc Pre-Engineering στο Pakistan Shipowner's College, ενισχύοντας τις αναλυτικές μου δεξιότητες. Αργότερα, απέκτησα πτυχίο BS στην Μηχανική Λογισμικού από το Indus University Pvt. Ltd., αποκτώντας εμπειρία στον προγραμματισμό και τον σχεδιασμό λογισμικού. Αυτό το ακαδημαϊκό υπόβαθρο έχει διαμορφώσει τις τεχνικές μου δεξιότητες και την νοοτροπία ανάπτυξης, προετοιμάζοντάς με για μια επιτυχημένη καριέρα στην ανάπτυξη λογισμικού."
        },
        {
            "title": "🛠️ Δεξιότητες",
            "description": "Ειδικεύομαι στην ανάπτυξη frontend, backend και βάσεων δεδομένων, με εμπειρία στην κατασκευή φιλικών προς τον χρήστη διεπαφών, επεκτάσιμων εφαρμογών από την πλευρά του διακομιστή και αποτελεσματικών συστημάτων διαχείρισης βάσεων δεδομένων. Οι δεξιότητές μου εκτείνονται στη δημιουργία απρόσκοπτων εμπειριών χρήστη, ισχυρών API και βελτιστοποιημένων λύσεων αποθήκευσης δεδομένων, διασφαλίζοντας την ολοκληρωμένη ανάπτυξη εφαρμογών λογισμικού υψηλής απόδοσης και αξιοπιστίας."
        }
    ]
  }
}
