{
  "meta": {
    "title": "Εμπειρία του Shakeel Haider",
    "description": "Βιογραφικό Εμπειρίας του Shakeel Haider",
    "keywords": "εμπειρία, shakeel haider, ανάπτυξη ιστού, ανάπτυξη λογισμικού, σχεδιασμός UI/UX, DevOps, Ανάπτυξη, λειτουργία, Frontend Lead Developer, RunOfShowApp, Fullstack Developer, freelancer, Sky Electric Pvt. Ltd, Concept Recall Pvt. Ltd, Retrocube Pvt. Ltd",
    "author": "Shakeel Haider"
  },
  "data": {
    "title": "Βιογραφικό",
    "description": "Με πάνω από 5 χρόνια στην ανάπτυξη λογισμικού, έχω εργαστεί σε τομείς frontend, mobile και full-stack, ξεκινώντας ως εκπαιδευόμενος στην Sky Electric Pvt. Ltd και προχωρώντας σε ρόλους στην Concept Recall Pvt. Ltd και στην Retrocube Pvt. Ltd. Επί του παρόντος, είμαι ο Frontend Lead Developer στην RunOfShowApp, οδηγώντας μια ομάδα για τη δημιουργία φιλικών προς τον χρήστη διεπαφών, ενώ εργάζομαι ως ελεύθερος επαγγελματίας Fullstack Developer από το 2020. Η καριέρα μου αναδεικνύει την προσαρμοστικότητα, την ομαδική εργασία και τη δέσμευση σε λύσεις υψηλής ποιότητας. Παθιασμένος με την κωδικοποίηση και την επίλυση προβλημάτων, μαθαίνω και αναπτύσσομαι συνεχώς ως ευέλικτος προγραμματιστής.",
    "items": [
      {
        "title": "Επικεφαλής Ομάδας",
        "companyName": "BCDApps",
        "date": "2022 - Παρόν",
        "description": "Ηγούμενος της ανάπτυξης frontend, επιβλέποντας μια ομάδα για τη δημιουργία φιλικών προς τον χρήστη διεπαφών και διασφαλίζοντας πρότυπα κώδικα υψηλής ποιότητας."
      },
      {
        "title": "Fullstack Developer (Ελεύθερος επαγγελματίας)",
        "companyName": "Upwork",
        "date": "2024 - Παρόν",
        "description": "Παρέχοντας ολοκληρωμένες λύσεις ιστού για διάφορους πελάτες, εστιάζοντας στην ανάπτυξη frontend και backend για την κάλυψη διαφορετικών απαιτήσεων έργου."
      },
      {
        "title": "Προγραμματιστής Λογισμικού",
        "companyName": "Retrocube Pvt. Ltd.",
        "date": "2021 - 2022",
        "description": "Συνεισέφερα σε έργα ανάπτυξης full-stack, συνεργαζόμενος με διαλειτουργικές ομάδες για τη δημιουργία επεκτάσιμων εφαρμογών ιστού."
      },
      {
        "title": "Junior Προγραμματιστής Λογισμικού",
        "companyName": "Concept Recall Pvt. Ltd.",
        "date": "2020 - 2021",
        "description": "Βοήθησα στην ανάπτυξη και συντήρηση εφαρμογών ιστού, αποκτώντας εμπειρία σε διάφορες τεχνολογίες και πλαίσια."
      },
      {
        "title": "Πρακτική Άσκηση Ανάπτυξης Λογισμικού",
        "companyName": "Sky Electric Pvt. Ltd.",
        "date": "2019 - 2020",
        "description": "Απέκτησα πρακτική εμπειρία στην ανάπτυξη λογισμικού, δουλεύοντας σε πραγματικά έργα και μαθαίνοντας τις βέλτιστες πρακτικές του κλάδου."
      }
    ]
  }
}
