{
  "meta": {
    "title": "Εκπαιδευτικό υπόβαθρο του Shakeel Haider",
    "description": "Εκπαιδευτικό υπόβαθρο του Shakeel Haider",
    "keywords": "βιογραφικό, shakeel haider, εμπειρία, εκπαίδευση, δεξιότητες, για μένα, ανάπτυξη ιστού, ανάπτυξη λογισμικού, σχεδιασμός UI/UX, DevOps, Ανάπτυξη, λειτουργία, σχεδιασμός διεπαφής χρήστη, σχεδιασμός εμπειρίας χρήστη, εφαρμογές ιστού, εφαρμογές κινητών, Πτυχίο Μηχανικού Λογισμικού, Πανεπιστήμιο Indus, Προ-Πτυχίο Μηχανικού, Κολλέγιο Ναυτικών Εταιρειών Πακιστάν, SSC, Σχολείο Al Nasir",
    "author": "Shakeel Haider"
  },
  "data": {
    "title": "Βιογραφικό",
    "description": "Το εκπαιδευτικό μου ταξίδι ξεκίνησε με το SSC από την Al Nasir School Pvt., προκαλώντας το ενδιαφέρον μου για την επίλυση προβλημάτων. Συνέχισα με FSc Pre-Engineering στο Pakistan Shipowner's College, ενισχύοντας τις αναλυτικές μου δεξιότητες. Αργότερα, απέκτησα πτυχίο BS στην Μηχανική Λογισμικού από το Indus University Pvt. Ltd., αποκτώντας εμπειρία στον προγραμματισμό και τον σχεδιασμό λογισμικού. Αυτό το ακαδημαϊκό υπόβαθρο έχει διαμορφώσει τις τεχνικές μου δεξιότητες και την νοοτροπία ανάπτυξης, προετοιμάζοντάς με για μια επιτυχημένη καριέρα στην ανάπτυξη λογισμικού.",
    "items": [
      {
        "title": "MS Τεχνητή Νοημοσύνη",
        "companyName": "Iqra University Pvt. Ltd.",
        "date": "2026 - Συνεχίζεται",
        "description": "Επικεντρώθηκε στην ανάπτυξη λογισμικού, αλγορίθμων και σχεδιασμού συστημάτων, αποκτώντας πρακτική εμπειρία μέσω έργων και πρακτικών ασκήσεων."
      },
      {
        "title": "Πτυχίο Μηχανικού Λογισμικού",
        "companyName": "Indus University Pvt. Ltd.",
        "date": "2016 - 2020",
        "description": "Επικεντρώθηκε στην ανάπτυξη λογισμικού, αλγορίθμων και σχεδιασμού συστημάτων, αποκτώντας πρακτική εμπειρία μέσω έργων και πρακτικών ασκήσεων."
      },
      {
        "title": "Προ-Πτυχίο Μηχανικού",
        "companyName": "Κολλέγιο Ναυτικών Εταιρειών Πακιστάν",
        "date": "2014 - 2016",
        "description": "Μελέτησε προχωρημένα μαθηματικά, φυσική και χημεία, αναπτύσσοντας ισχυρές αναλυτικές δεξιότητες και δεξιότητες επίλυσης προβλημάτων."
      },
      {
        "title": "SSC",
        "companyName": "Al Nasir School Pvt. Ltd.",
        "date": "2012 - 2014",
        "description": "Ολοκλήρωσε τη δευτεροβάθμια εκπαίδευση με έμφαση στις επιστημονικές θεματικές, θέτοντας τα θεμέλια για μελλοντικές σπουδές στη μηχανική."
      }
    ]
  }
}
