{
    "meta": {
        "title": "Έργα του Shakeel Haider",
        "description": "Έργα του Shakeel Haider",
        "keywords": "έργα, shakeel haider, projects, portfolio, ανάπτυξη ιστού, ανάπτυξη λογισμικού, σχεδιασμός UI/UX, DevOps, Ανάπτυξη, λειτουργία, σχεδιασμός διεπαφής χρήστη, σχεδιασμός εμπειρίας χρήστη, εφαρμογές ιστού, εφαρμογές κινητών",
        "author": "Shakeel Haider"
    },
    "data": {
        "title": "Έργα",
        "items": [
            {
                "count": "01",
                "role": "Frontend Lead",
                "desc": "Το RunOfShow είναι μια εφαρμογή ιστού που βοηθά τους διοργανωτές εκδηλώσεων να διαχειρίζονται τις εκδηλώσεις τους αποτελεσματικά. Παρέχει μια πλατφόρμα για τη δημιουργία, διαχείριση και κοινή χρήση προγραμμάτων εκδηλώσεων, επιτρέποντας στους χρήστες να οργανώνουν και να εκτελούν εκδηλώσεις απρόσκοπτα. Ως ο επικεφαλής προγραμματιστής Frontend, ηγήθηκα της ανάπτυξης της εφαρμογής, δημιουργώντας φιλικές προς τον χρήστη διεπαφές και διασφαλίζοντας μια ομαλή εμπειρία χρήστη."
            },
            {
                "count": "02",
                "role": "Full Stack Developer",
                "desc": "Το Hello Aya είναι μια εφαρμογή ιστού που παρέχει στους χρήστες τη δυνατότητα να κάνουν κράτηση δωματίων ή διαμερισμάτων για τη διαμονή τους. Επιτρέπει στους χρήστες να αναζητούν διαθέσιμα δωμάτια, να προβάλλουν λεπτομέρειες και να κάνουν κρατήσεις. Ως προγραμματιστής Full Stack, συνέβαλα στην ανάπτυξη της εφαρμογής, εστιάζοντας στη δημιουργία ανταποκρινόμενων και διαισθητικών διεπαφών χρήστη και ισχυρής λειτουργικότητας backend."
            },
            {
                "count": "03",
                "role": "Full Stack Developer",
                "desc": "Το Hey Planner είναι μια εφαρμογή ιστού που βοηθά τους χρήστες να σχεδιάζουν και να οργανώνουν εκδηλώσεις. Παρέχει μια πλατφόρμα για τη δημιουργία, διαχείριση και κοινή χρήση λεπτομερειών εκδηλώσεων, επιτρέποντας στους χρήστες να συντονίζουν και να εκτελούν εκδηλώσεις απρόσκοπτα. Ως προγραμματιστής Full Stack, συνέβαλα στην ανάπτυξη της εφαρμογής, εστιάζοντας στη δημιουργία ανταποκρινόμενων και διαισθητικών διεπαφών χρήστη και ισχυρής λειτουργικότητας backend."
            },
            {
                "count": "04",
                "role": "Frontend Developer",
                "desc": "Το Stunt Listing είναι μια εφαρμογή ιστού που συνδέει τους εκτελεστές ακροβατικών με τους διοργανωτές εκδηλώσεων. Επιτρέπει στους εκτελεστές να δημιουργούν προφίλ, να παρουσιάζουν τις δεξιότητές τους και να υποβάλλουν αίτηση για δουλειές, ενώ οι διοργανωτές μπορούν να δημοσιεύουν εκδηλώσεις, να προβάλλουν τα προφίλ των εκτελεστών και να προσλαμβάνουν ταλέντα. Ως προγραμματιστής Frontend, συνέβαλα στην ανάπτυξη της εφαρμογής, εστιάζοντας στη δημιουργία ανταποκρινόμενων και διαισθητικών διεπαφών χρήστη."
            },
            {
                "count": "05",
                "role": "Full Stack Developer",
                "desc": "Το Minglee είναι μια εφαρμογή κοινωνικής δικτύωσης που συνδέει χρήστες βάσει κοινών ενδιαφερόντων. Επιτρέπει στους χρήστες να δημιουργούν προφίλ, να συνδέονται με άλλους και να μοιράζονται περιεχόμενο, δημιουργώντας μια κοινότητα ομοϊδεατών ατόμων. Ως προγραμματιστής Full Stack, συνέβαλα στην ανάπτυξη της εφαρμογής, εστιάζοντας στη δημιουργία μιας απρόσκοπτης εμπειρίας χρήστη και ισχυρής αρχιτεκτονικής backend."
            },
            {
                "count": "06",
                "role": "Mobile Developer",
                "desc": "Το RunOfShowApp είναι μια εφαρμογή για κινητά που βοηθά τους διοργανωτές εκδηλώσεων να διαχειρίζονται τις εκδηλώσεις τους αποτελεσματικά. Παρέχει μια πλατφόρμα για τη δημιουργία, διαχείριση και κοινή χρήση προγραμμάτων εκδηλώσεων, επιτρέποντας στους χρήστες να οργανώνουν και να εκτελούν εκδηλώσεις απρόσκοπτα. Ως προγραμματιστής κινητών, συνέβαλα στην ανάπτυξη της εφαρμογής, εστιάζοντας στη δημιουργία μιας απρόσκοπτης εμπειρίας χρήστη και διαισθητικής διεπαφής."
            },
            {
                "count": "07",
                "role": "Mobile Developer",
                "desc": "Το SkyElectric είναι μια εφαρμογή για κινητά που επιτρέπει στους χρήστες να παρακολουθούν και να ελέγχουν τα ηλιακά τους συστήματα ενέργειας. Παρέχει δεδομένα σε πραγματικό χρόνο για την παραγωγή ενέργειας, την κατανάλωση και τις εξοικονομήσεις, επιτρέποντας στους χρήστες να βελτιστοποιήσουν τη χρήση ενέργειας τους. Ως προγραμματιστής κινητών, συνέβαλα στην ανάπτυξη της εφαρμογής, εστιάζοντας στη δημιουργία μιας φιλικής προς τον χρήστη διεπαφής και μιας απρόσκοπτης εμπειρίας χρήστη."
            }
        ]
    }
}